app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT `urls`.* FROM `urls`

  def show
    @url = Url.find_by(shortened_url: params[:shortened_url])
---
SELECT  `urls`.* FROM `urls` WHERE `urls`.`shortened_url` = 'osJRPt' LIMIT 1

  def create
    @url = Url.new(url_params)
    respond_to do |format|
      if @url.save
        format.html { redirect_to @url, notice: 'Url was successfully created.' }
        format.json { render json: {url: @url.shortened_url, status: 200 } }
      else
        format.html { render :new }
        format.json { render json: {url: @url.errors.full_messages.join(', '), status: 500 } }
---
INSERT INTO `urls` (`original_url`, `shortened_url`, `created_at`, `updated_at`) VALUES ('https://njstate.com', 'UX1qnv', '2019-01-06 02:41:26', '2019-01-06 02:41:26')
SELECT  `urls`.* FROM `urls` ORDER BY `urls`.`id` DESC LIMIT 1

    def increment_count
       @url.update_attribute(:count, @url.count + 1) if @url
---
UPDATE `urls` SET `count` = 1, `shortened_url` = 'NGyYiu', `updated_at` = '2019-01-06 02:46:18' WHERE `urls`.`id` = 7

    def set_url
      @url = Url.find(params[:id])
---
SELECT  `urls`.* FROM `urls` WHERE `urls`.`id` = 0 LIMIT 1